# 后端组 第一次python作业
# 编译器都可以 最终需要在个人的github上发布作业（需要用git命令上传） 具体上传方式可自行百度
# git参考链接：
#   https://my.oschina.net/SimTao/blog/1924050
#    https://www.jianshu.com/p/b683f449484e

'''
Homework Testing 1 这部分是一些基础语句和基础算法，请大家通过自己想出来，不要百度，基础的算法逻辑很重要 
                   这里就不写冒泡选择那些排序了 python对于逻辑考的不多
'''
# 1.Example 输入两个数，求出它们的和并输出。
    # 样例输入：1 2
    # 样例输入：3
print("1 2")
print(1+2)

# 2.输入三角形的三边，求周长(int)、面积(float)、并判断是否为直角三角形(Boolean)
#     样例输入：3 4 5
#     样例输入：12 6.00000 True
# *****************************************************************

# *****************************************************************

# 3.输入一个年份，判断是不是闰年 (Boolean)
    # 样例输入1：2008
    # 样例输入1：True
    # 样例输入2：2100
    # 样例输入2：False
# *****************************************************************

# *****************************************************************

# 4.输入一个数n，n∈N*，如果是素数（质数），则输出True (Boolean)
    # 样例输入1：3
    # 样例输入1：True
    # 样例输入2：9
    # 样例输入2：False
# *****************************************************************

# *****************************************************************

# 5.Sn=a+aa+aaa+aaaa+aaa…..a(n个)，a,n输入的数a,n∈N*
# 比如a=8时，S4=8+88+888+8888=9872(int)
#     样例输入：8 4
#     样例输出：9872
# *****************************************************************

# *****************************************************************

# 6.输出所有的水仙花数。水仙花数是它本身恰好等于他各个位数上的立方和的三位数。如
# 153=1^3+5^3+3^3，153是水仙花数
    # 样例输入：
    # 样例输出：153,370,371,407
# *****************************************************************

# *****************************************************************

# 7.输入一个日期，计算出自从2000.1.1到这一天已经过了多久
#     样例输入：2000.1.2
#     样例输出：2
# *****************************************************************

# *****************************************************************


'''
Homework Testing 2 这部分是一些基础库的运用，大家可以参考官方文档简单运用
                   调用库写在相应的框中
'''
# 1.turtle库的运用：大家随便画点吧，这个库太阴间了，想要画复杂的建议用cad先画一个草图，这个随便画画就行，不用很认真对待
# *****************************************************************

# *****************************************************************

# 2.math库的运用： 计算sin(35)、cos(67)、ln(8)的值
# *****************************************************************

# *****************************************************************

# 3.jieba库的运用： 将本句分词并提取词汇出现频率
# 输入内容：
'''
    真是闲处光阴易过，倏忽又是元宵佳节。士隐令家人霍启抱了英莲，去看社火花灯。半夜中霍启因要小解，
便将英莲放在一家门槛上坐着。待他小解完了来抱时，那有英莲的踪影？急的霍启直寻了半夜。至天明不见，
那霍启也不敢回来见主人，便逃往他乡去了。那士隐夫妇见女儿一夜不归，便知有些不好；再使几人去找寻，
回来皆云影响全无。夫妻二人半世只生此女，一旦失去，何等烦恼，因此昼夜啼哭，几乎不顾性命。
'''
# 输出示例:
'''
{'真是': 1, '闲处': 1, '光阴': 1, '易过': 1, '倏忽': 1, '元宵': 1, '佳节': 1, '士隐令': 1, '家人': 1,
 '霍启抱': 1, '英莲': 3, '社火': 1, '花灯': 1, '半夜': 2, '中霍启': 1, '因要': 1, '小解': 2, '放在': 1, 
 '一家': 1, '门槛': 1, '那有': 1, '踪影': 1, '霍启直': 1, '天明': 1, '不见': 1, '霍启': 1, '不敢': 1,
  '回来': 2, '主人': 1, '逃往': 1, '那士': 1, '夫妇': 1, '女儿': 1, '一夜': 1, '不归': 1, '便知': 1, 
  '有些': 1, '不好': 1, '几人': 1, '找寻': 1, '影响': 1, '全无': 1, '夫妻': 1, '二人': 1, '半世': 1, 
  '只生': 1, '一旦': 1, '失去': 1, '何等': 1, '烦恼': 1, '因此': 1, '昼夜': 1, '啼哭': 1, '几乎': 1, 
  '不顾': 1, '性命': 1}
'''
# *****************************************************************

# *****************************************************************

